## Necessary Module Importation

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os
from dotenv import dotenv_values
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LinearRegression
from sklearn.metrics import mean_squared_error, r2_score
from sklearn.ensemble import RandomForestRegressor
from sklearn.preprocessing import StandardScaler
from sklearn.impute import SimpleImputer
from sklearn.feature_selection import SelectKBest, f_regression
from sklearn.model_selection import GridSearchCV
from sklearn.preprocessing import PolynomialFeatures
from statsmodels.stats.outliers_influence import variance_inflation_factor
from sklearn.model_selection import cross_val_score
import statsmodels.api as sm
import gdown
import logging
import pyodbc
import datetime as dt
from scipy.stats import shapiro
from scipy.stats import ttest_ind
from sklearn.model_selection import train_test_split
import warnings
warnings.filterwarnings('ignore')

## Data Loading and Storage

In [3]:
Holidays_Data = pd.read_csv('C:\\Users\\USER\\Downloads\\holiday_data.csv')
Holidays_Data.head()

,Unnamed: 0,date,type,locale,locale_name,description,transferred
0,0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [4]:
Holidays_Data.to_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\Holidays_Data.csv', index=False)
Holidays_Data = pd.read_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\Holidays_Data.csv')
Holidays_Data.head()

,Unnamed: 0,date,type,locale,locale_name,description,transferred
0,0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

In [5]:
oil_data = pd.read_csv('C:\\Users\\USER\\Downloads\\oil_data.csv')
oil_data.to_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\oil_data.csv', index=False)
oil_data = pd.read_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\oil_data.csv')
oil_data.head()

   Unnamed: 0        date  dcoilwtico
0           0  2013-01-01         NaN
1           1  2013-01-02   93.139999
2           2  2013-01-03   92.970001
3           3  2013-01-04   93.120003
4           4  2013-01-07   93.199997

In [6]:
stores_data = pd.read_csv('C:\\Users\\USER\\Downloads\\stores_data.csv')
stores_data.to_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\stores_data.csv', index=False)
stores_data = pd.read_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\stores_data.csv')
stores_data.head()

,Unnamed: 0,store_nbr,city,state,type,cluster
0,0,1,Quito,Pichincha,D,13
1,1,2,Quito,Pichincha,D,13
2,2,3,Quito,Pichincha,D,8
3,3,4,Quito,Pichincha,D,9
4,4,5,Santo Domingo,Santo Domingo de los Tsachilas,D,4

In [7]:
test_data = pd.read_csv('C:\\Users\\USER\\Downloads\\test.csv')
test_data.to_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\test_data.csv', index=False)
test_data = pd.read_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\test_data.csv')
test_data.head()

        id        date  store_nbr      family  onpromotion
0  3000888  2017-08-16          1  AUTOMOTIVE            0
1  3000889  2017-08-16          1   BABY CARE            0
2  3000890  2017-08-16          1      BEAUTY            2
3  3000891  2017-08-16          1   BEVERAGES           20
4  3000892  2017-08-16          1       BOOKS            0

In [8]:
train_data = pd.read_csv('C:\\Users\\USER\\Downloads\\train_data.csv')
train_data.to_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\train_data.csv', index=False)
train_data = pd.read_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\train_data.csv')
train_data.head()

   id        date  store_nbr      family  sales  onpromotion
0   0  2013-01-01          1  AUTOMOTIVE    0.0            0
1   1  2013-01-01          1   BABY CARE    0.0            0
2   2  2013-01-01          1      BEAUTY    0.0            0
3   3  2013-01-01          1   BEVERAGES    0.0            0
4   4  2013-01-01          1       BOOKS    0.0            0

In [9]:
Transactions_Data = pd.read_csv('C:\\Users\\USER\\Downloads\\transactions.csv')
Transactions_Data.to_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\Transactions_Data.csv', index=False)
Transactions_Data = pd.read_csv('C:\\Users\\USER\\.vscode\\Data_Science_Projects\\Data_Science_Projects\\Data\\Transactions_Data.csv')
Transactions_Data.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

## Data Cleaning and Exploration

In [10]:
Holidays_Data

,Unnamed: 0,date,type,locale,locale_name,description,transferred
0,0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False
...,...,...,...,...,...,...,...
345,345,2017-12-22,Additional,National,Ecuador,Navidad-3,False
346,346,2017-12-23,Additional,National,Ecuador,Navidad-2,False
347,347,2017-12-24,Additional,National,Ecuador,Navidad-1,False
348,348,2017-12-25,Holiday,National,Ecuador,Navidad,False
349,349,2017-12-26,Additional,National,Ecuador,Navidad+1,False

In [11]:
Holidays_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 7 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   350 non-null    int64
 1   date         350 non-null    object
 2   type         350 non-null    object
 3   locale       350 non-null    object
 4   locale_name  350 non-null    object
 5   description  350 non-null    object
 6   transferred  350 non-null    bool
dtypes: bool(1), int64(1), object(5)
memory usage: 16.9+ KB

Date column is in 'Object' format

In [12]:
Holidays_Data.describe()

       Unnamed: 0
count  350.000000
mean   174.500000
std    101.180532
min      0.000000
25%     87.250000
50%    174.500000
75%    261.750000
max    349.000000

In [13]:
Holidays_Data.isnull().sum()

Unnamed: 0     0
date           0
type           0
locale         0
locale_name    0
description    0
transferred    0
dtype: int64

In [41]:
Holidays_Data.duplicated().sum()

0

In [15]:
test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28512 entries, 0 to 28511
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           28512 non-null  int64
 1   date         28512 non-null  object
 2   store_nbr    28512 non-null  int64
 3   family       28512 non-null  object
 4   onpromotion  28512 non-null  int64
dtypes: int64(3), object(2)
memory usage: 1.1+ MB

Date column is in 'Object' format

In [16]:
test_data.describe()

                 id     store_nbr   onpromotion
count  2.851200e+04  28512.000000  28512.000000
mean   3.015144e+06     27.500000      6.965383
std    8.230850e+03     15.586057     20.683952
min    3.000888e+06      1.000000      0.000000
25%    3.008016e+06     14.000000      0.000000
50%    3.015144e+06     27.500000      0.000000
75%    3.022271e+06     41.000000      6.000000
max    3.029399e+06     54.000000    646.000000

In [17]:
test_data.isnull().sum()

id             0
date           0
store_nbr      0
family         0
onpromotion    0
dtype: int64

In [40]:
test_data.duplicated().sum()

0

In [18]:
Transactions_Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

Date column is in 'Object' format

In [19]:
Transactions_Data.describe()

          store_nbr  transactions
count  83488.000000  83488.000000
mean      26.939237   1694.602158
std       15.608204    963.286644
min        1.000000      5.000000
25%       13.000000   1046.000000
50%       27.000000   1393.000000
75%       40.000000   2079.000000
max       54.000000   8359.000000

In [20]:
Transactions_Data.isnull().sum()

date            0
store_nbr       0
transactions    0
dtype: int64

In [39]:
Transactions_Data.duplicated().sum()

0

In [21]:
oil_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1218 entries, 0 to 1217
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  1218 non-null   int64
 1   date        1218 non-null   object
 2   dcoilwtico  1175 non-null   float64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.7+ KB

Date column is in 'Object' format

In [22]:
oil_data.isnull().sum()

Unnamed: 0     0
date           0
dcoilwtico    43
dtype: int64

In [38]:
oil_data.duplicated().sum()

0

In [26]:
stores_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  54 non-null     int64
 1   store_nbr   54 non-null     int64
 2   city        54 non-null     object
 3   state       54 non-null     object
 4   type        54 non-null     object
 5   cluster     54 non-null     int64
dtypes: int64(3), object(3)
memory usage: 2.7+ KB

In [27]:
stores_data.describe()

       Unnamed: 0  store_nbr    cluster
count   54.000000  54.000000  54.000000
mean    26.500000  27.500000   8.481481
std     15.732133  15.732133   4.693395
min      0.000000   1.000000   1.000000
25%     13.250000  14.250000   4.000000
50%     26.500000  27.500000   8.500000
75%     39.750000  40.750000  13.000000
max     53.000000  54.000000  17.000000

In [28]:
stores_data.isnull().sum()

Unnamed: 0    0
store_nbr     0
city          0
state         0
type          0
cluster       0
dtype: int64

In [37]:
stores_data.duplicated().sum()

0

In [30]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000888 entries, 0 to 3000887
Data columns (total 6 columns):
 #   Column       Dtype
---  ------       -----
 0   id           int64
 1   date         object
 2   store_nbr    int64
 3   family       object
 4   sales        float64
 5   onpromotion  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 137.4+ MB

Date column is in 'Object' format

In [31]:
train_data.describe()

                 id     store_nbr         sales   onpromotion
count  3.000888e+06  3.000888e+06  3.000888e+06  3.000888e+06
mean   1.500444e+06  2.750000e+01  3.577757e+02  2.602770e+00
std    8.662819e+05  1.558579e+01  1.101998e+03  1.221888e+01
min    0.000000e+00  1.000000e+00  0.000000e+00  0.000000e+00
25%    7.502218e+05  1.400000e+01  0.000000e+00  0.000000e+00
50%    1.500444e+06  2.750000e+01  1.100000e+01  0.000000e+00
75%    2.250665e+06  4.100000e+01  1.958473e+02  0.000000e+00
max    3.000887e+06  5.400000e+01  1.247170e+05  7.410000e+02

In [33]:
train_data.isnull().sum()

id             0
date           0
store_nbr      0
family         0
sales          0
onpromotion    0
dtype: int64

In [42]:
train_data.duplicated().sum()

0

#### Univariate Analysis

In [ ]:
sales_by_time = train_data.groupby('date').sales.sum()
sales_by_time = sales_by_time.set_index('date')
sales_by_time.plot(figsize = (10,4))